#include <stdio.h>
int main() 
{
    int arr[7]; 
    for (int i = 0; i<7; i++)
    {
      printf("Enter celiy number: ");
      scanf("%d", &arr[i]);
    }
    //"якщо найменше поточне насправді НЕ є найменшим" - ми змінюємо його на елемент масива, тому початкове значення повинно бути достаменно більше ніж будь які елементи масива, щоб заміна точно відбулася
    int naymen1 = +99999;
    int naymen2 = +99999;
    //створюємо ще дві переменні, у яких будемо хранити номера ціх змінних у масиві
    int n1 = 0;
    int n2 = 0; 
    //створюємо цикл пошуку двух найменших чисел у масиві
    for (int i = 0; i<7; i++){
        if (naymen1>arr[i]){ //якщо поточне найменш1 більше за елемент масиву, то найменш1 = arr[i], тобто поточному елементу масива 
        naymen1 = arr[i];
        n1 = i; // просто i тому, що нам ПОТІМ потрібно замінити елементи під ціми номерами
        }
        else //перевіряємо, чи можливо саме друге число є найменшим після першого 
        {
         if (naymen2>arr[i]){ 
            naymen2 = arr[i];
            n2 = i;
        }
        }
    }
    //створюємо зміну півсуми, щоб зробити заміну 
    int pivsum = (naymen1 + naymen2)/2; //ці скобки саме зараз відповідають за аріфметичні операції. Якщо скобки після тексту, до раовно, то це або функція, або умова для if та for тощо, а якщо ПІСЛЯ =, то це аріфметична операція
    arr[n1] = pivsum; //користуємося збереженими номерами елементів, щоб змінити їх значення (14-15)
    arr[n2] = pivsum;
    
    return 0;
}