#include <stdio.h>
//stdio - "стандартний ввод\вивод" 
//переменна - ячейка для хранення результату. int, double, float - nип. Без типу не можу сотворити переменну. Тип - розмір памяті для переменной 
int main() 
{
    double arr[7]; // double відповідає за усі числа (усе що для 4 байтів), int лише за цілі, а float за зменьшеню точність (усе що для 2 байтів)
    for (int i = 0; i<7; i++)
    {
      printf("Enter deystvitelnyi number english is good: ");
      scanf("%f", &arr[i]); // & - вказівник на память. arr - імя масива, [] - номер елементу. Зазвичай використовуємо для того, щоб передати у функцію змінну яка буде змінена всередині функції
    }
    double sum = 0; // сума, сюда будемо прибовляти елементи масива. Начальне значення 0 тому, що нам не потрібно, щоб воно впливало на результат 
    double dob = 1; // добуток, це число будемо множити на елементи масива. Для множення потрібне 1, щоб початкове значення не впливало на кінцевий результат. Якщо б тут був ноль, то завжди був би ноль
    for (int i = 0; i<7; i++)
    // () - в if у круглих душках пишеться логічеська операція, а у {} для if пишеться блок коду, який виконується якщо результат цієї логічнох операції true
    {
        if(i%2==0){
            sum = sum+arr[i];
        } 
        else {
            dob = dob*arr[i];
        }
    }
      printf("dob: %f \t sum: %f", 
            dob , sum);
   
    return 0;
}